# Desafio: bora praticar?

Para praticar os métodos aprendidos no decorrer dessa aula e também aprender novos, vamos realizar alguns tratamentos e seleções utilizando um arquivo csv diferente: alunos.csv.

Com base nisso, solucione os problemas propostos abaixo utilizando os conhecimentos adquiridos até aqui.

In [44]:
import pandas as pd

dados = pd.read_csv("arquivos/alunos.csv")
dados.head()

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    NaN     False
2  Cátia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True

In [45]:
dados.shape

(18, 4)

In [46]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nome      18 non-null     object
 1   Idade     18 non-null     int64
 2   Notas     12 non-null     float64
 3   Aprovado  18 non-null     bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 578.0+ bytes

In [47]:
dados.describe()

           Idade      Notas
count  18.000000  12.000000
mean   25.500000   6.800000
std     6.070662   2.204953
min    18.000000   2.500000
25%    21.000000   5.450000
50%    24.500000   7.000000
75%    28.750000   8.250000
max    37.000000  10.000000

**1)** Verifique se a base de dados possui dados nulos e, caso tenha, realize o tratamento desses dados nulos da forma que achar mais coerente com a situação.

In [48]:
dados.isnull().sum()

Nome        0
Idade       0
Notas       6
Aprovado    0
dtype: int64

In [49]:
#Exibir linhas com dados Nulos
dados[dados.isnull().any(axis=1)]

      Nome  Idade  Notas  Aprovado
1      Ana     18    NaN     False
5    Bruna     23    NaN     False
9    Vitor     28    NaN     False
10  Daniel     21    NaN     False
14   Paulo     37    NaN     False
16   Lucas     33    NaN     False

In [50]:
dados = dados.fillna(0)
dados.isnull().sum()

Nome        0
Idade       0
Notas       0
Aprovado    0
dtype: int64

**2)** Os alunos "Alice" e "Carlos", não fazem mais parte da turma. Sendo assim, remova-os da base de dados.

In [51]:
dados.query('Nome == "Alice" |Nome == "Carlos" ')

     Nome  Idade  Notas  Aprovado
7  Carlos     19    6.0      True
8   Alice     35    5.6     False

In [52]:
registros_a_remover = dados.query('Nome == "Alice" |Nome == "Carlos" ').index
dados.drop(registros_a_remover, axis=0, inplace=True)
dados.query('Nome == "Alice" |Nome == "Carlos" ')

Empty DataFrame
Columns: [Nome, Idade, Notas, Aprovado]
Index: []

**3)** Aplique um filtro que selecione apenas os alunos que foram aprovados.

In [53]:
dados.query('Aprovado == True ')

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
4        Beto     21   10.0      True
6        Dara     21    7.0      True
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True
15     Mylena     29    7.0      True
17      Nadia     34    8.0      True

**4)** Salve o DataFrame que possui apenas os alunos aprovados em um arquivo csv chamado "alunos_aprovados.csv".

In [54]:
alunos_aprovados = dados.query('Aprovado == True ')
alunos_aprovados.to_csv("arquivos/alunos_aprovados.csv",index=False)

**Extra**: Ao conferir as notas dos alunos aprovados, notamos que algumas notas estavam incorretas. As alunas que tiraram nota 7.0, na verdade, tinham um ponto extra que não foi contabilizado. Sendo assim, substitua as notas 7.0 da base de dados por 8.0. Dica: pesquise pelo método replace.

In [55]:
dados = pd.read_csv("arquivos/alunos_aprovados.csv")
dados.head()

        Nome  Idade  Notas  Aprovado
0        Ary     20    7.5      True
1       Beto     21   10.0      True
2       Dara     21    7.0      True
3  Sthefanie     26    9.5      True
4      Mirla     25    9.0      True

In [56]:
dados.query("Notas == 7")

     Nome  Idade  Notas  Aprovado
2    Dara     21    7.0      True
5  Mylena     29    7.0      True

In [57]:
dados.Notas.replace(7.0, 8.0, inplace=True)
dados.query("Nome =='Dara' | Nome == 'Mylena'")

/tmp/ipykernel_62852/1079594256.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dados.Notas.replace(7.0, 8.0, inplace=True)

     Nome  Idade  Notas  Aprovado
2    Dara     21    8.0      True
5  Mylena     29    8.0      True

In [58]:
dados.to_csv("arquivos/alunos_aprovados_corrigido.csv")